# №1
# def seven(num): # перевод в семеричную систему
#     digits = '0123456'
#     if n < 7:
#         return digits[num]
#     return seven(num // 7) + digits[num % 7]
# print(seven(6 * 343**5 + 5 * 49**7 - 50).count('6'))
from itertools import count

# №2
# def three(num):
#     digits = '012'
#     if num < 3:
#         return digits[num]
#     return three(num // 3) + digits[num % 3]
# print(three(9**8 + 3**5 - 9).count('2'))



# №3
# def f(num):
#     digits = '012345'
#     if num < 6: # число тут говорит о том в какую систему счисления я перевожу
#         return digits[num]
#     return f(num // 6) + digits[num % 6]
# print(f(3 * 216**4 + 2 * 36**6 - 648).count('5'))



# №4
# for x in '0123456789AB':
#     for y in '0123456789AB':
#         exp = int(x + '231' + y, 12) + int('78' + x + '98' + y, 14)
#         if exp % 99 == 0:
#             print(exp // 99)
#             break



# №5
# for x in '0123456789': 
#     exp = int('3' + x + 'DA', 14) + int('5' + x + 'A6', 12) # выражение из условия, тут я и строю два числа int
#     if exp % 81 == 0:  # проверяю по условию, кратно ли 81
#         print(exp // 81)



# №6
# for x in '0123456789A':
#     for y in '0123456789A':
#         exp = int(x + '341' + y, 11) + int('56' + x + '1' + y, 19)
#         if exp % 305 == 0:
#             print(exp // 305)



# №7
# for x in '0123456789': 
#     exp = int('8' + x + '71', 13) + int('3' + x + 'DF', 17)
#     if exp % 197 == 0:
#         print(exp // 197)



# №8
# for x in '0123456789': 
#     exp = int('1' + x + '563', 14) + int('871' + x + '3', 14)
#     if exp % 24 == 0:
#         print(exp // 24)



# №9
# def three(num):
#     digits = '012'
#     if num < 3:
#         return digits[num]
#     return three(num // 3) + digits[num % 3]

# for x in range(2031): 
#     if three(3**100 - x).count('0') == 2: # записываю выражение в троичной системе счисления, и проверяю количество нулей, нам нужно 2
#         print(x)
#         break



# №10
# В системе счисления с основанием p выполняется равенство zxyx7+xy836=wzx64.
# Буквами x, y, z и w обозначены некоторые цифры из алфавита системы счисления с
# основанием p. Определите значение числа xyzwp и запишите это значение в десятичной системе счисления.
# for p in range(1, 10): # система счисления p
#     for x in range(1, p):
#         for y in range (1, p):
#             for z in range (1, p):
#                 for w in range(1, p):
#                     exp1 = z*p**4 + x*p**3 + y*p**2 + x*p**1 + 7 # выражение 1
#                     exp2 = x*p**4 + y*p**3 + 8*p**2 + 3*p**1 + 6 # выражение 2
#                     exp3 = w*p**4 + z*p**3 + x*p**2 + 6*p**1 + 4 # выражение 3
#                     if exp1 + exp2 == exp3: # zxyx7+xy836=wzx64
#                         print(x*p**3 + y*p**2 + z*p**1 + w*p**0) # xyzwp



# №11
# result = 36**7 + 6**30 - 12

# def to_base_6(n):
#     if n == 0:
#         return "0"
#     digits = []
#     while n:
#         digits.append(int(n % 6))
#         n //= 6
#     return ''.join(str(x) for x in digits[::-1])

# base_6_result = to_base_6(result)
# count_5 = base_6_result.count('5')

# print(count_5, base_6_result)



# №11
# Значение выражения 36^7+6^19 − 18 записали в системе счисления с основанием 6.
# Сколько цифр 5 содержится в этой записи?
# def convert_to(number, base):
#     digits = '012345'
#     result=''

#     while number > 0:
#         result = digits[number % base] + result
#         number //= base
#     return result

# example = 36**7 + 6**19 - 18
# example_base_6 = convert_to(example, 6)
# print(example_base_6.count('5'))



# №12 Сколько единиц содержится в двоичной записи значения выражения 8^7+4^5+2^10 − 32?
# print(bin(8**7 + 4**5 + 2**10 - 32)[2:].count('1'))



# №13 Операнды арифметического выражения записаны в системе счисления с основаниями 14 и 12: 3xDA 14+5xA6 12.
# В записи чисел переменной x обозначена неизвестная цифра из алфавита десятичной системы счисления. 
# Определите наименьшее значение x, при котором значение данного арифметического выражения кратно 81. 
# Для найденного значения x вычислите частное от деления значения арифметического выражения на 81 и укажите его в ответе в десятичной системе счисления.
# for x in '0123456789':
#     example = int('3' + x + 'DA', 14) + int('5' + x + 'A6', 12)
#     if example % 81 == 0:
#         print(example // 81)
#         break



# №14 Операнды арифметического выражения записаны в системах счисления с основаниями 8 и 11: y04x5 11+253xy 8.
# В записи чисел переменными x и y обозначены допустимые в данных системах счисления неизвестные цифры. 
# Определите значения x и y, при которых значение данного арифметического выражения будет наименьшим и кратно 117.
# Для найденных значений x и y вычислите частное от деления значения арифметического выражения на 117 и укажите его в ответе в десятичной системе счисления.
# for x in '01234567':
#     for y in '01234567':
#         example = int(y + '04' + x + '5', 11) + int('253' + x + y, 8)
#         if example % 117 == 0:
#             print(example // 117)
#             break



# №15 В числе 58x723y49 39 x и y обозначают некоторые цифры из алфавита системы счисления с основанием 39.
# Определите такие значения x и y, при которых приведённое число кратно 38, а число yx 39 является полным квадратом. 
# В ответе запишите значение числа yx 39 в десятичной системе счисления.
# result = []
# for x in range(39):
#     for y in range(39):
#         t = 5 * 39**8 + 8 * 39**7 + x * 39**6 + 7 * 39**5 + 2 * 39**4 + 3 * 39**3 + y * 39**2 + 4 * 39 * 1 + 9
#         if t % 38 == 0 and (y * 39**1 + x)**0.5 == round((y * 39**1 + x)**0.5):
#             result.append(y * 39**1 + x)
# print(max(result))



# №16 Сколько единиц содержится в двоичной записи значения выражения: 4^2016 + 2^2015 − 7?
# print(bin(4**2016 + 2**2015 - 7).count('1'))



# 341)	(ЕГЭ-2022)
# e = 4 * 625**1920 + 4 * 125**1930 - 4 * 25**1940 - 3 * 5**1950 - 1960
# count = 0
# while e > 0:
#     if e % 5 == 0:
#         count += 1
#     e //= 5
# print(count)



# 342)	(ЕГЭ-2022)
# e = 13 * 625**1320 + 12 * 125**1230 - 14 * 25**1140 - 13*5**1050 - 2500
# count = 0
# while e > 0:
#     if e % 25 == 0:
#         count += 1
#     e //= 25
# print(count)



# 343)	(ЕГЭ-2022)
# e = 7 * 512**3200 + 6 * 256**3100 - 5 * 64**3000 - 4 * 8**2900 - 1542
# count = 0
# while e > 0:
#     if e % 64 == 0:
#         count_0 += 1
#     e //= 64
# print(count)



# 344)	(ЕГЭ-2022)
# e = 343**1515 - 6*49**1520 + 5*49**1510 - 3*7**1530 - 1550
# count = 0
# while e > 0:
#     if e % 7 == 0:
#         count += 1
#     e //= 7
# print(count)



# 486)	(Демо-2025)
# e = 3 * 3125**8 + 2 * 625**7 - 4 * 625**6 + 3 * 125**5 - 5 * 25**4 - 2025
# count = 0
# while e > 0:
#     if e % 25 == 0:
#         count += 1
#     e //= 25
# print(count)



# ЕГКР
# e = 4 * 3125**2019 + 3 * 625**2020 - 2 * 125**2021 + 25**2022 - 4 * 5**2023 - 2024
# count = 0
# while e > 0:
#     if e % 25 > 10:
#         count += 1
#     e //= 25
# print(count)



# Демо 2024
# for x in '0123456789abcdefghi':
#     x1 = int(f'98897{x}21', 19)
#     x2 = int(f'2{x}923', 19)
#     if (x1 + x2) % 18 == 0:
#         print(x, (x1 + x2) // 18)



# 435)	(ЕГЭ-2023)
# for x in '0123456789abcdefghi':
#     x1 = int(f'98{x}79641', 19)
#     x2 = int(f'36{x}14', 19)
#     x3 = int(f'73{x}4', 19)
#     if (x1 + x2 + x3) % 18 == 0:
#         print(x, (x1 + x2 + x3) // 18)



# 436)	(ЕГЭ-2023)
# for x in '0123456789abcdefghijkl':
#     x1 = int(f'18{x}89957', 22)
#     x2 = int(f'80{x}33', 22)
#     x3 = int(f'521{x}6', 22)
#     if (x1 + x2 + x3) % 21 == 0:
#         print(x, (x1 + x2 + x3) // 21)



# 437)	(ЕГЭ-2023)
# for x in '0123456789abcdefghijklm':
#     x1 = int(f'7{x}38596', 23)
#     x2 = int(f'14{x}36', 23)
#     x3 = int(f'61{x}7', 23)
#     if (x1 + x2 + x3) % 22 == 0:
#         print(x, (x1 + x2 + x3) // 22)



# 487)	(Демо-2025)
# for x in '0123456789abcdefghi':
#     x1 = int(f'98897{x}21', 19)
#     x2 = int(f'2{x}923', 19)
#     if (x1 + x2) % 18 == 0:
#         print(x, (x1 + x2) // 18)



# 485)	(Демо-2025)
# res = []
# for x in range(1, 2031):
#     e = 7**170 + 7**100 - x
#     count = 0
#     while e > 0:
#         if e % 7 == 0:
#             count += 1
#         e //= 7
#     if count == 71:
#         res.append(x)
# print(max(res))



#
# e = 2 * 729**2014 + 2 * 243**2016 - 2 * 81**2018 + 2 * 27**2020 - 2 * 9**2022 - 2024
# count = 0
# while e > 0:
#     if e % 27 > 9:
#         count += 1
#     e //= 27
# print(count)




# № 21413 Досрочная волна 2025
# for x in '0123456789abcdefghijk':
#     e = int(f'82934{x}2', 21) + int(f'2924{x}{x}7', 21) + int(f'67564{x}8', 21)
#     if e % 20 == 0:
#         print(e//20)
#         break




# № 20904 Апробация 05.03.25
# res = []
# for x in range(1, 2031):
#     e = 3**100 - x
#     count = 0
#     while e > 0:
#         if e % 3 == 0:
#             count += 1
#         e //= 3
#     if count == 1:
#         res.append(x)
# print(max(res))



# № 19246 ЕГКР 21.12.24
# for x in '0123456789abcdefghijklmno':
#     e = int(f'11353{x}12', 25) + int(f'135{x}21', 25)
#     if e % 24 == 0:
#         print(e // 24)



# № 17633 Основная волна 19.06.24
# res = []
# for x in range(1, 2031):
#     e = 6**260 + 6**160 + 6**60 - x
#     count = 0
#     while e > 0:
#         if e % 6 == 0:
#             count += 1
#         e //= 6
#     if count == 202:
#         res.append(x)
# print(min(res))




# № 17555 Основная волна 08.06.24
# res = []
# for x in range(1, 2031):
#     e = 7**91 + 7**160 - x
#     count = 0
#     while e > 0:
#         if e % 7 == 0:
#             count += 1
#         e //= 7
#     if count == 70:
#         res.append(x)
# print(max(res))




# № 16380 ЕГКР 27.04.24
# e = 4 * 3125**2019 + 3 * 625**2020 - 2 * 125**2021 + 25**2022 - 4 * 5**2023 - 2024
# count = 0
# while e > 0:
#     if e % 25 > 10:
#         count +=1
#     e //= 25
# print(count)



# № 15328 Досрочная волна 2024
for x in '0123456789abcdefghijklmnopq':
    e = int(f'123{x}24', 27) + int(f'135{x}78', 27)
    if e % 26 == 0:
        print(e // 26)