# № 20804 Апробация 05.03.25
# N = 2048
# i = 11
# V = 1280 * 960 * i
#
# v_передачи = 96468992
# t_передачи = 132
# print((v_передачи * t_передачи) / V)



# № 19239 ЕГКР 21.12.24
# V_photo = 3840 * 2160 * 24
# photo_amount = 3742
# V_ssd = 16 * 8 * 1024 * 1024 * 1024
#
# photos_in_one_ssd = V_ssd // V_photo
#
# print(photo_amount - photos_in_one_ssd * 5)



# № 18613
# V = (1536 * 1024 * 12) / 1024 / 8
# V_пакета = 150 * V
# V_передачи = 288 * 4 * 60
# print(V_передачи / V_пакета)



# № 17979 Основная волна 07.06.24
# V = 2 * 34 * 48000 * (42 * 60 + 20)
# V_передачи = 314572800
# print(V / V_передачи)



# № 17626 Основная волна 19.06.24
# x = 1280
# y = 1024
# скорость_передачи = 1966080
#
# res = []
# for t in range(1, 281):
#     for i in range(1, 100):
#         объем_пакета = 39 * x * y * i
#         if объем_пакета < (t * скорость_передачи):
#             res.append(i)
# print(2**max(res))



# № 17520 Основная волна 07.06.24
# V = 1024 * 960 * 13
# скорость_передачи = 1474560
#
# res = []
# for t in range(1, 281):
#     for снимков_в_пакете in range(1, 300):
#         if снимков_в_пакете * V <= скорость_передачи * t:
#             res.append(снимков_в_пакете)
# print(max(res))



# № 17548 Основная волна 08.06.24
# V = 1024 * 960 * 11
# скорость_передачи = 96468992
#
# res = []
# for t in range(1, 281):
#     for снимков_в_пакете in range(1, 4000):
#         if V * снимков_в_пакете <= скорость_передачи * t:
#             res.append(снимков_в_пакете)
# print(max(res))



# № 9776 Основная волна 20.06.23
# for t in range(1, 100000):
#     if 967 * 1024 * 1024 * 8 >=  4 * (192 * 1000) * 16 * t:
#         print(t)
# print('В минутах: ', 660 / 60)



# № 9738 Основная волна 19.06.23
# скорость_передачи = 65536
# V = 1024 * 768 * (3 * 8)
#
# res =[]
# for t in range(1, 1000):
#     if t <= V / скорость_передачи:
#         res.append(t)
# print(max(res))



# № 21406 Досрочная волна 2025
# V1 = 3840 * 2160 * 17
# V2 = 1280 * 720 * 5
# print(((V1 - V2) * 120) / 8 / 1024)



# 17670
# from math import *
# x = 1024
# y = 960
# paket = 32
# V_передачи = 1474560
#
# res = []
# for N in range(1, 5000):
#     for t in range(1, 141):
#         i = log2(N)
#         S_передачи = x*y*i*paket
#         if t == S_передачи / V_передачи:
#             res.append(N)
# print(max(res))



# 15319
# from math import *
# x = 2764
# y = 1793
# N = 7026
# i = ceil(log2(N))
# paket = 148
# V_передачи = 18_349_566
# S_передачи = x*y*i*paket
# t = S_передачи / V_передачи
# print(t) # ЦЕЛУЮ ЧАСТЬ, НЕ ОКРУГЛЯТЬ!!



# 7609
# t = 90
# N = 2
# i = 16
# v = 48000
# S_гс = t*N*i*v
# V_передачи = 3200
# t_передачи = S_гс / V_передачи
# print(t_передачи)



# 7586
# N = 2
# i = 24
# v = 16000
# t = 90
# S_передачи = N*i*v*t
# V_передачи = 64000
# t_передачи = S_передачи / V_передачи
# print(t_передачи)



# 3213
# from math import *
# x = 486
# y = 720
# V_сжат = 80*1024*8
# V_до_сжат = V_сжат / 0.85
#
# res = []
# for N in range(1, 10000):
#     i = log2(N)
#     if x*y*i <= V_до_сжат:
#         res.append(N)
# print(max(res))

# аналог от гпт
from math import *
t = 60
v = 8000
V_сжат = 50*1024*8
V_до_сжат = V_сжат / 0.8

res = []
for N in range(1, 5000):
    i = log2(N)
    if i*t*v <= V_до_сжат:
        res.append(N)
print(max(res))





















